// Tibetan [bo]
// Generated: Sat Jan 14 2023

import { dayjs } from '../dayjs'
import type { Locale } from '.'

const locale: Locale = {
  name: 'bo',
  weekdays: [
    'གཟའ་ཉི་མ་',
    'གཟའ་ཟླ་བ་',
    'གཟའ་མིག་དམར་',
    'གཟའ་ལྷག་པ་',
    'གཟའ་ཕུར་བུ',
    'གཟའ་པ་སངས་',
    'གཟའ་སྤེན་པ་',
  ],
  weekdaysShort: [
    'ཉི་མ་',
    'ཟླ་བ་',
    'མིག་དམར་',
    'ལྷག་པ་',
    'ཕུར་བུ',
    'པ་སངས་',
    'སྤེན་པ་',
  ],
  weekdaysMin: [
    'ཉི་མ་',
    'ཟླ་བ་',
    'མིག་དམར་',
    'ལྷག་པ་',
    'ཕུར་བུ',
    'པ་སངས་',
    'སྤེན་པ་',
  ],
  months: [
    'ཟླ་བ་དང་པོ',
    'ཟླ་བ་གཉིས་པ',
    'ཟླ་བ་གསུམ་པ',
    'ཟླ་བ་བཞི་པ',
    'ཟླ་བ་ལྔ་པ',
    'ཟླ་བ་དྲུག་པ',
    'ཟླ་བ་བདུན་པ',
    'ཟླ་བ་བརྒྱད་པ',
    'ཟླ་བ་དགུ་པ',
    'ཟླ་བ་བཅུ་པ',
    'ཟླ་བ་བཅུ་གཅིག་པ',
    'ཟླ་བ་བཅུ་གཉིས་པ',
  ],
  monthsShort: [
    'ཟླ་དང་པོ',
    'ཟླ་གཉིས་པ',
    'ཟླ་གསུམ་པ',
    'ཟླ་བཞི་པ',
    'ཟླ་ལྔ་པ',
    'ཟླ་དྲུག་པ',
    'ཟླ་བདུན་པ',
    'ཟླ་བརྒྱད་པ',
    'ཟླ་དགུ་པ',
    'ཟླ་བཅུ་པ',
    'ཟླ་བཅུ་གཅིག་པ',
    'ཟླ་བཅུ་གཉིས་པ',
  ],
  formats: {
    LT: 'A h:mm',
    LTS: 'A h:mm:ss',
    L: 'DD/MM/YYYY',
    LL: 'D MMMM YYYY',
    LLL: 'D MMMM YYYY, A h:mm',
    LLLL: 'dddd, D MMMM YYYY, A h:mm',
  },
  relativeTime: {
    future: '%s ལ་',
    past: '%s སྔོན་ལ་',
    s: 'ཏོག་ཙམ་',
    m: 'སྐར་མ་གཅིག་',
    mm: 'སྐར་མ་ %d',
    h: 'ཆུ་ཚོད་གཅིག་',
    hh: 'ཆུ་ཚོད་ %d',
    d: 'ཉིན་གཅིག་',
    dd: 'ཉིན་ %d',
    M: 'ཟླ་བ་གཅིག་',
    MM: 'ཟླ་བ་ %d',
    y: 'ལོ་གཅིག་',
    yy: 'ལོ་ %d',
  },
}

dayjs.locale(locale, true)
export default locale
